{
  "_locale": "en",
  "_locale_name": "English",
  "thumb-success": "Thumbnail uploaded.",
  "thumb-error": "Failed to upload thumbnail.",
  "thumb-error-413": "The file is too big.",
  "thumb-error-503": "Thumbnail server is having a problem. Please wait and try again.",
  "comment-type-user": "user",
  "comment-type-gallery": "studio",
  "comment-type-project": "project",
  "comment-error-empty": "You can't post an empty comment.",
  "comment-error-ratelimit": "You are posting too quickly. Please wait longer between posts.",
  "comment-error-filterbot-generic": "The filterbot thinks the comment did not meet the guidelines of Scratch.",
  "comment-error-filterbot-chat": "You are not allowed to post comments that mention chat websites or social media.",
  "comment-error-filterbot-spam": "The filterbot thinks the comment contains a spam, a chain mail, or an ASCII art.",
  "comment-error-disabled": "It seems like commenting is turned off for this {commentType}.",
  "comment-error-ip": "Scratch Team blocked your network because it was abused by someone. Please contact {email} with appeal ID {appealId}.",
  "comment-error-toolong": "The comment is too long.",
  "comment-error-unverified": "Please verify your email before commenting.",
  "comment-error-down": "Scratch server is having a problem. Please try again later.",
  "comment-mute": "You cannot post comments until the mute expires automatically.",
  "comment-mute-pii": "You are muted for trying to share personal information or mentioning chat websites/social media.",
  "comment-mute-unconstructive": "You are muted because the filterbot thought the comment was unconstructive.",
  "comment-mute-vulgarity": "You are muted because the the filterbot detected a bad word in the comment.",
  "comment-mute-spam": "You are muted because the filterbot detected a spam, a chain mail, or an ASCII art in the comment.",
  "comment-mute-general": "You are muted because the filterbot thought the comment violated the guidelines."
}
