{"editor-devtools/help-title":"Scratch 3-Entwicklertools","editor-devtools/ctrl-space":"Strg + Leertaste oder mittlere Maustaste","editor-devtools/code-tab-features":"Code-Tab-Funktionen","editor-devtools/interactive-find-bar":"Interaktive Suchleiste (Strg + F)","editor-devtools/improved-tidy-up":"Verbessertes Aufräumen von Blöcken","editor-devtools/copy-to-clipboard":"In Zwischenablage kopieren","editor-devtools/copy-to-clipboard-desc":"Wenn mit der rechten Maustaste auf einen Block geklickt wird, stehen 3 neue Optionen zur Verfügung: Alle Kopieren, Block Kopieren und Block Ausschneiden. Die Option Alles Kopieren kopiert alles einschließlich die Blöcke unterhalb des angeklickten Blockes in die Zwischenablage. Block Kopieren kopiert nur den angeklickten Block und seinen Inhalt, sonst nichts. Block Ausschneiden kopiert ihn und entfernt ihn aus dem Arbeitsbereich.","editor-devtools/paste-from-clipboard":"Aus Zwischenablage einfügen","editor-devtools/paste-from-clipboard-desc":"Fügt von der Zwischenablage ein, aber an der Stelle, an der sich der Mauszeiger befindet, damit Sie es dann platzieren können (und nicht wie bei der aktuellen Scratch-Implementierung an der Stelle, von dem zu kopierenden Block).","editor-devtools/swap-variable":"Variable in Figur austauschen","editor-devtools/swap-variable-desc":"Klicke mit der rechten Maustaste auf eine Variable in Skripten für diese neue Option. Erlaubt es, alle Verweise auf diese Variable in der aktuellen Figur auf einmal auf eine andere Variable umzuschalten. Eignet sich hervorragend, wenn ein Fehler gemacht wurde und von einer Variable zu einer anderen gewechselt werden soll oder von einem \"für alle Figuren\" zu einem \"Nur für diese Figur\" wechseln müssen. Diese Option wird die alte Variable nicht entfernen und wird keine Variablen in anderen Figuren beeinflussen.","editor-devtools/middleclick":"Mittelklick","editor-devtools/middleclick-desc":"Bei Benutzung der mittleren Maustaste auf einer Variable oder einem Benutzerdefinierten Block springt man zu seiner Definition oder öffnet ihn in der interaktiven Suchleiste.","editor-devtools/ctrl-lr":"Strg + Links, Strg + Rechts","editor-devtools/ctrl-lr-desc":"Navigiere im Skript zur vorherigen/nächsten Position (nach Verwendung der zum-Block-navigieren oder Suchleiste). Auf diese Weise kann mit einem Mittelklick auf einen Benutzerdefinierten Block zu seiner Definition gesprungen werden und danach mit Strg + Linksklick zur Stelle zurückkehren, an der man sich zuvor befunden hat.","editor-devtools/costume-tab-features":"Kostümtab Funktionen","editor-devtools/find-bar":"Suchleiste","editor-devtools/ctrl-lr-costume-desc":"Diese Tasten navigieren dich zum vorherigen/nächsten Kostüm in der Figur.","editor-devtools/send-top-bottom":"Nach oben schicken, Nach unten schicken","editor-devtools/send-top-bottom-desc":"Klicke mit der Rechten Maustaste auf ein Kostüm und siehe 2 neue Menüpunkte an. Diese können verwendet werden, um die angeklickte Figur an den Anfang oder ans Ende der Kostümliste zu schicken, was für schnelles Umordnen praktisch ist.","editor-devtools/youtube":"YouTube-Tutorials","editor-devtools/var-not-exist":"Diese Variable existiert nicht...","editor-devtools/find":"Finden","editor-devtools/find-placeholder":"Finde (Strg + F)","editor-devtools/deep":"Tief","editor-devtools/help":"Hilfe","editor-devtools/paste":"Einfügen","editor-devtools/copy-all":"Alle Kopieren","editor-devtools/copy-block":"Block Kopieren","editor-devtools/cut-block":"Block Ausschneiden","editor-devtools/lists":"Listen","editor-devtools/variables":"Variablen","editor-devtools/insert":"Einfügen","editor-devtools/start-typing":"Beginn mit der Eingabe...","editor-devtools/@name":"Entwicklertools","editor-devtools/@description":"Fügt ein Suchfeld und neue Menüoptionen zum Editor hinzu: Kopieren/Einfügen von Blöcken, besseres Aufräumen, gehe zu Definitionen von Benutzerdefinierten Blöcken und vieles mehr!"}