{"editor-devtools/help-title":"Scratch 3 Fejlesztői Eszközök","editor-devtools/help-by":"{url} és a Scratch Addons hozzájárulói & fordítói által","editor-devtools/ctrl-space":"Ctrl + Szóköz, Középső egérgomb, vagy Shift + Kattintás","editor-devtools/ctrl-space-desc":"Megjelenít egy lebegő gépelő ablakot, ahova beírhatod egy blokknak a nevét (vagy részleteket belőle) és behúzhatod a blokkot a kódba, hogy ott hasznát vehesd. Ha egyszerre több blokkot akarsz hozzáadni, a Shift nyomvatartásával nyitvatarthatod az ablakot.","editor-devtools/code-tab-features":"Kód Sáv Funkciók","editor-devtools/interactive-find-bar":"Interaktív Keresőmező (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Találj meg és ugorj gyorsan bármely Egyéni Blokkhoz, Változóhoz, Üzenethez, vagy Felső blokkhoz egy szereplőben, azzal hogy rákattintasz az új keresőmezőre, amely a Kód, Jelmezek és Hangok fülektől jobbra található. Kezdj el gépelni, hogy leszűrd a listát. Használd a fel és a le nyilakat, hogy váltogass a lehetséges opciók közt, illetve a balra és jobbra nyilakat, hogy válts a blokk összes talált előfordulási helye közt.","editor-devtools/improved-tidy-up":"Fejlesztett Kód Rendrakás","editor-devtools/improved-tidy-up-desc":"Jobb kattints a kódoló területre, hogy megjelenítsd a menüt és a Rendrakás opció helyén egy Rendrakás + opciót fogsz találni. Használd ezt, hogy feltakaríts a kódok között az oszlopokat is figyelembe véve, illetve mozgatva a kommenteket és eltávolítva az összes kódon kívüli változót, stb.","editor-devtools/help-new":"★Új★","editor-devtools/help-make-space":"Csinálj Helyet","editor-devtools/help-make-space-desc":"Csinálj extra helyet az adott kód körül, azzal hogy jobb kattintasz rá és a \"Csinálj Helyet\" opciót választod.","editor-devtools/copy-to-clipboard":"Másolás a Vágólapra","editor-devtools/copy-to-clipboard-desc":"Kattints jobb egérgombbal egy blokkra és 3 új opció lesz elérhető, ezek a Minden Másolása, Blokk Másolása és a Blokk Kivágása. A Minden Másolása opció vágólapra másolja a blokkot és az alatta elhelyezkedő többi blokkot is. A Blokk Másolása csak a jelenlegi blokkot fogja másolni, alóla semmit. A blokk kivágása pedig kimásolja, majd eltávolvítja a blokkot a kód mezőből.","editor-devtools/paste-from-clipboard":"Másolás a Vágólapról","editor-devtools/paste-from-clipboard-desc":"Bemásolja a vágólapról a lemásolt blokkokat, de fontos, hogy oda másolja, ahol a kurzorod éppen van, szóval te helyezheted el (a helyett, hogy ugyanoda tenné, mint a jelenlegi scratch implementáció).","editor-devtools/swap-variable":"Változó Cseréje a Szereplőben","editor-devtools/swap-variable-desc":"Jobb kattints egy változóra a kódjaidban ezért az új opcióért. Megengedi, hogy egyszerre kicserélj minden hivatkozást az adott változóra a jelenlegi szereplőben egy másik változóra. Ez akkor jó, amikor hibát követsz el és át kell válts egy másik változóra egy szereplőben vagy váltanod kell a 'Minden szereplőé'-ről 'A kiválasztott szereplőé'-re. Ez az opció nem fogja eltávolítani az eredeti változót és más szereplők változóit sem cseréli le.","editor-devtools/middleclick":"Ugorj a definícióhoz","editor-devtools/middleclick-desc":"A középső egérgomb, vagy a Shift gomb használata mellett változók, vagy saját blokkokra történő kattintás esetén lehetővé teszi, hogy rögtön odaugorj a definiáláshoz, vagy megnyissad az interaktív keresőmezőt.","editor-devtools/ctrl-lr":"Ctrl + Bal, Ctrl + Jobb","editor-devtools/ctrl-lr-desc":"Navigálás előző / következő látogatott pozícióhoz a kód mezőben (miután használtad a navigálás blokkhoz funkciót vagy a keresőmezőt). Lehetővé teszi, hogy középső egérgombbal rákattints egy saját blokkra és a definíciójához ugorj, ezt követően a ctrl + balra nyíllal visszatérhetsz oda, ahol korábban voltál.","editor-devtools/costume-tab-features":"Jelmezek Fül Funkciók","editor-devtools/find-bar":"Keresőmező","editor-devtools/find-bar-costume-desc":"Kattints minden jelmez rendezéséhez név szerint, majd gépelj, hogy kereshess. Használd a nyilakat vagy kattints az egérrel, hogy válassz egy jelmezt, amelyhez odaugrasz.","editor-devtools/ctrl-lr-costume-desc":"Ezek a gombok az előző / következő jelmezhez navigálnak az adott szereplőben.","editor-devtools/youtube":"YouTube tutorialok","editor-devtools/orphaned":"{count, plural, one {Fejlesztői eszközök: Törölni szeretnél 1 kódon kívüli értékadó blokkot?} other {Fejlesztői eszközök: Törölni szeretnél # kódon kívüli értékadó blokkot?} }","editor-devtools/unused-var":"{count, plural, one {Fejlesztői eszközök: Törölni szeretnél 1 nem használt helyi változót? Itt van:\n} other {Fejlesztői eszközök: Törölni szeretnél # nem használt helyi változót? Itt vannak:\n} }","editor-devtools/unused-list":"{count, plural, one {Fejlesztői eszközök: Törölni szeretnél 1 nem használt helyi listát? Itt van:\n} other {Fejlesztői eszközök: Törölni szeretnél # nem használt heliy listát? Itt vannak:\n} }","editor-devtools/var-not-exist":"Ez a változó nem létezik...","editor-devtools/find":"Keresés","editor-devtools/find-placeholder":"Keresés (Ctrl+F)","editor-devtools/deep":"Mély","editor-devtools/help":"Súgó","editor-devtools/tutorials":"Tutorialok","editor-devtools/replace":"Fejlesztői eszközök: Lecserélsz minden {name} változót ebben a szereplőben egy másik változóra, amit úgy hívnak:","editor-devtools/top":"küldés felülre","editor-devtools/bottom":"küldés alulra","editor-devtools/clean-plus":"Rendrakás +","editor-devtools/paste":"Beillesztés","editor-devtools/copy-all":"Minden Másolása","editor-devtools/copy-block":"Blokk Másolása","editor-devtools/cut-block":"Blokk Kivágása","editor-devtools/make-space":"Csinálj Helyet","editor-devtools/swap":"{var} cserélye a Szereplőben","editor-devtools/lists":"listák","editor-devtools/variables":"változók","editor-devtools/insert":"Beszúrás","editor-devtools/start-typing":"Kezdj Gépelni...","editor-devtools/extension-description-not-for-addon":"Scratch 3 Fejlesztői Eszközök, hogy feldobják a Scratch Szerkesztői Élményeidet a https://scratch.mit.edu oldalon","editor-devtools/@name":"Fejlesztői eszközök","editor-devtools/@description":"Hozzáad egy keresőmezőt és új menü opciókat a szerkesztőhöz: másolj/illessz be blokkokat, jobb rendrakás, ugorj saját blokk definíciójához, és még sok más! Nyomj Ctrl+F-t, hogy elkezdhess gépelni a keresőmezőbe, Ctrl+Szóközt, hogy felhozd az \"illessz be blokkot névalapján\" felugró menüt, Ctrl+Bal/Jobb Nyíl, hogy a keresési előzményekben kalandozz.","editor-devtools/@settings-name-enableCleanUpPlus":"Fejlesztett \"Rendrakás\"","editor-devtools/@settings-name-enablePasteBlocksAtMouse":"Blokkok beillesztése a kurzorhoz","editor-devtools/@settings-name-enableMiddleClickFinder":"Kattints középső egérgombbal változókra, saját blokkokra vagy eseményekre, hogy navigálj"}