{"editor-devtools/help-title":"Scratch 3-Ontwikkelaarstools","editor-devtools/help-by":"door {url} en Scratch Addons-helpers & -vertalers","editor-devtools/ctrl-space":"Ctrl + Spatie, Middelklik, of Shift + Klik","editor-devtools/ctrl-space-desc":"Laat een zwevende invoerbox zien waar je de naam van een blok (of delen ervan) kunt intypen om vervolgens het blok te slepen naar de code om daar te gebruiken. Houd Shift ingedrukt bij het slepen om de box niet te sluiten als je meerdere blokken tegelijk wilt toevoegen.","editor-devtools/code-tab-features":"Codetabbladfuncties","editor-devtools/interactive-find-bar":"Interactieve Zoekbalk (Ctrl + F)","editor-devtools/interactive-find-bar-desc":"Zoek en spring naar je Eigen Blokken, Variabelen, Gebeurtenis, of Hoedblok gedefinieerd in een sprite door op de nieuwe zoekbalk rechts van de Code-, Uiterlijken- en Geluiden-tabbladen. Start met typen om de lijst te filteren. Gebruik de omhoog- en omlaagpijltjestoetsen om te schakelen tussen de verschillende mogelijkheden, en de links- en rechtspijltjestoetsen om te wisselen tussen alle gevonden blokken.","editor-devtools/improved-tidy-up":"Verbeterde Codeopruiming","editor-devtools/improved-tidy-up-desc":"Rechterklik op het codegebied voor het rechterklikmenu waar Blokken Opruimen is vervangen met Blokken Opruimen +. Gebruik dit om je scripts overzichtelijk te houden en je scripts in kolommen te houden, en ook probeert het de opmerkingen recht te houden en het verwijderd alle ongebruikte variabelen.","editor-devtools/help-new":"★Nieuw★","editor-devtools/help-make-space":"Ruimte Maken","editor-devtools/help-make-space-desc":"Maak extra ruimte rond een script door te rechterklikken op het script en kies \"Ruimte Maken\".","editor-devtools/copy-to-clipboard":"Naar Klembord Kopiëren","editor-devtools/copy-to-clipboard-desc":"Rechterklik op een blok voor 3 nieuwe opties: Alles Kopiëren, Blok Kopiëren, en Blok Knippen. De Alles Kopiëren-optie kopieert alles, inclusief alles onder en het blok dat je hebt geklikt. Blok Kopiëren kopieert alleen het huidige blok en zijn inhoud, maar niets eronder. Blok Knippen kopieert het en verwijdert het van het codegebied.","editor-devtools/paste-from-clipboard":"Plakken vanaf Klembord","editor-devtools/paste-from-clipboard-desc":"Plakt vanaf het klembord, maar meest belangrijk, het plakt waar je muisaanwijzer nu is zodat je het in een script kunt plaatsen (in tegenstelling tot plaatsen waar je het hebt gekopieerd zoals in de huidige scratchimplementatie).","editor-devtools/swap-variable":"Variabelen Wisselen in Sprite","editor-devtools/swap-variable-desc":"Rechterklik op een variabele in je scripts voor deze nieuwe optie. Het laat je alle verwijzingen naar deze variabele in de huidige sprite allemaal tegelijk wisselen naar een andere variabele. Dit is geweldig als je een fout hebt gemaakt en je van een naar een andere variabele wilt wisselen of moet veranderen van 'voor alle sprites' naar 'alleen voor deze sprite'. Deze optie verwijdert of beïnvloedt de andere variabelen niet.","editor-devtools/middleclick":"Springen Naar","editor-devtools/middleclick-desc":"Spring met de middelste muisknop of Shift + Klik naar een variabele of eigen blokdefinitie of open het in de interactieve zoekbalk.","editor-devtools/ctrl-lr":"Ctrl + Links, Ctrl + Rechts","editor-devtools/ctrl-lr-desc":"Naar vorige / volgende bezochte positie in het codegebied navigeren (na het gebruiken van blok navigeren of zoekbalk). Dit laat je met de middelste muisknop klikken op een eigen blok om naar zijn definitie te gaan, druk dan op ctrl + Links om terug te gaan naar waar je eerst was.","editor-devtools/costume-tab-features":"Uiterlijkstabbladfuncties","editor-devtools/find-bar":"Zoekbalk","editor-devtools/find-bar-costume-desc":"Klik om alle uiterlijken op naam te sorteren, en typ om er een te vinden. Gebruik de pijltjestoetsen of muis om op een naam te klikken om naar dat uiterlijk te springen.","editor-devtools/ctrl-lr-costume-desc":"Deze toetsen navigeren je naar het vorige / volgende uiterlijk in de sprite.","editor-devtools/youtube":"YouTube-lessen","editor-devtools/orphaned":"{count, plural, one {Ontwikkelaarstools: 1 los meldingsblok verwijderen?} other {Ontwikkelaarstools: # losse meldingsblokken verwijderen?} }","editor-devtools/unused-var":"{count, plural, one {Ontwikkelaarstools: 1 ongebruikte lokale variabele verwijderen? Hier is het:\n} other {Ontwikkelaarstools: # ongebruikte lokale variabelen verwijderen? Hier zijn ze:\n} }","editor-devtools/unused-list":"{count, plural, one {Ontwikkelaarstools: 1 ongebruikte lokale lijst verwijderen? Hier is het:\n} other {Ontwikkelaarstools: # ongebruikte lokale lijsten verwijderen? Hier zijn ze:\n} }","editor-devtools/var-not-exist":"Die variabele bestaat niet...","editor-devtools/find":"Zoeken","editor-devtools/find-placeholder":"Zoeken (Ctrl+F)","editor-devtools/deep":"Diep","editor-devtools/tutorials":"Lessen","editor-devtools/replace":"Ontwikkelaarstools: Alle {name} in deze sprite wisselen voor de variabele genaamd:","editor-devtools/top":"naar boven","editor-devtools/bottom":"naar onder","editor-devtools/clean-plus":"Blokken Opruimen +","editor-devtools/paste":"Plakken","editor-devtools/copy-all":"Alles Kopiëren","editor-devtools/copy-block":"Blok Kopiëren","editor-devtools/cut-block":"Blok Knippen","editor-devtools/make-space":"Ruimte Maken","editor-devtools/swap":"Wissel {var} in Sprite","editor-devtools/lists":"lijsten","editor-devtools/variables":"variabelen","editor-devtools/insert":"Invoegen","editor-devtools/start-typing":"Begin met typen...","editor-devtools/extension-description-not-for-addon":"Scratch 3 Ontwikkelaarstools om je Scratch Editing-Ervaring te verbeteren op https://scratch.mit.edu","editor-devtools/@name":"Ontwikkelaarstools","editor-devtools/@settings-name-enableCleanUpPlus":"\"Blokken opruimen\" Verbeteren","editor-devtools/@settings-name-enablePasteBlocksAtMouse":"Blokken plakken bij muisaanwijzer","editor-devtools/@settings-name-enableMiddleClickFinder":"Gebruik de middelste muisknop op variabelen, eigen blokken of gebeurtenissen om te navigeren"}